# В университете на факультет кибернетики очень серьёзный конкурс — поступают только сильнейшие,
# первые десять человек из списка. Потом среди поступивших определяется, кто будет получать стипендию.
# Для стипендии общий балл при поступлении должен быть не менее 290.
# Напишите программу, которая получает на вход место студента в списке и его балл, а затем выводит
# соответствующие сообщения о поступлении и получении стипендии.


place = int(input('Введите место в списке поступающих: '))
exam = int(input('Введите количество баллов за экзамены: '))

if place <= 10:
    print('Поздравляем вы поступили!')
    if exam > 290:
        print('Бонусом вам будет начисляться стипендия.')
    else:
        print('Но вам не хватило баллов для стипендии.')
else:
    print('К сожалению, вы не поступили.')
