# Степан хочет поступить на бюджет в престижный университет, но для этого ему нужно хорошо сдать
# три экзамена и набрать как минимум 270 баллов.Напишите программу, которая запрашивает у пользователя
# результаты ЕГЭ по трём экзаменам и проверяет, поступил он на бюджет или нет.
# Выведите соответствующее сообщение.

namber_1 = int(input('Введите количество баллов по русскому языку: '))
namber_2 = int(input('Введите количество баллов по математике: '))
namber_3 = int(input('Введите количество баллов по информатике: '))
summ = namber_3 + namber_2 + namber_1
ball = 270
if summ >= ball:
    print('Поздравляю, ты поступил на бюджет!')
else:
    print('К сожалению, ты не прошел на бюджет!')