# Напишите программу для примера, разобранного в уроке. Пользователь покупает курс стоимостью 75 000 рублей.
# Если денег на счету достаточно, то нужно:
# Списать со счёта деньги.
# Проверить баланс счёта. Если там меньше 5000 рублей, то зачислить на счёт 1000 рублей и вывести сообщение: «Сделана скидка».
# Вывести сообщение: «Курс успешно приобретён».
# А иначе вывести: «Не хватает денег на счету». Также в конце вывести остаток счёта и сообщение: «Хорошего дня!»

summ = int(input('Сколько денег на счету? '))
cours = 75000
if summ >= cours:
    print('Курс успешно приобретен!')
    summ -= 75000
    if summ < 5000:
        summ += 1000
        print('Сделана скидка.')
else:
    print('Не хватает денег на счету.')
print('Остаток на счету: ', summ)
print('Хорошего дня!')