# Андрей переехал в новую квартиру, и ему нужно купить три стула в разные комнаты.
# Естественно, цена на стулья в разных магазинах различается, а где-то ещё и скидка есть.
# Вот для одного из таких магазинов он и написал калькулятор скидки, чтобы проще ориентироваться в ценах.
# Напишите программу, которая запрашивает три стоимости товара и вычисляет сумму чека.
# Если сумма чека превышает 10 000 рублей, нужно вычесть из этой суммы скидку 10%.
# В конце вывести итоговую сумму на экран.


price_1 = int(input('Введите первую цену: '))
price_2 = int(input('Введите вторую цену: '))
price_3 = int(input('Введите третью цену: '))
summ = price_1 + price_2 + price_3
if summ > 10000:
    print('Итого: ', summ - (summ * 10 / 100),  'руб.')
else:
    print('Итого: ', summ, 'руб.')

