# В некоторых странах действует так называемая прогрессивная шкала налогообложения:
# чем больше ты зарабатываешь, тем больший налог платишь. Нужно написать программу,
# которая будет рассчитывать сумму налога исходя из прибыли. Если прибыль до 10 000
# — ставка налога равна 13%, начиная с 10 000 и до 50 000 — 20%. А начиная с 50 000
# — 30%. А также нужно добавить «проверку на дурака»: если ввели число меньше нуля,
# то вывести сообщение: «Ошибка: доход не может быть отрицательным».

summ = int(input('Сколько вы зарабатываете? '))
if summ < 0:
    print('Ошибка: доход не может быть отрицательным.')
elif summ <= 10000:
    tax = summ * 13 / 100
    print('Налог составит (13%): ', tax)
elif summ <= 50000:
    tax = summ * 20 / 100
    print('Налог составит (20%): ', tax)
else:
    tax = summ * 30 / 100
    print('Налог составит (30%): ', tax)