# Для настольной игры используются карточки с номерами от 1 до N.
# Одна карточка потерялась. Найдите ее, зная номера оставшихся карточек.
# Вводится число N, далее еще N − 1 чисел: номера оставшихся карточек (различные числа от 1 до N).
# Программа должна вывести номер потерянной карточки.

summ2 = 0
card = int(input('Введите количество карточек: '))
for i in range(1, card):
    summ2 -= int(input('Введите наименование карточки: '))
    summ2 += i
    f'i =  {i}'
    f'cумма = {summ2}'
summ2 += card
print('Не хватает карточки:', summ2)