# Огромный заповедник поделён на большое количество секторов. И у каждого сектора есть номер.
# Мы ответственны за группу секторов с номерами с 30-го по 35-ый и нам нужно следить за тем,
# чтобы посетителей в каждом секторе было меньше 10. А заодно и фиксировать для общей статистики,
# сколько раз это правило было нарушено.
# Напишите программу, которая для каждого сектора запрашивает текущее количество людей в нём,
# и если оно больше 10, то фиксирует нарушение. В конце выведите количество нарушений

violation = 0
for sektor in range(30, 35):
    question = int(input(f'Сколько людей в {sektor} секторе: '))
    if question > 10:
        print('Нарушение! Слишком много людей в секторе!')
        violation += 1
    else:
        print('Все спокойно.')
print('Всего нарушений: ', violation)