# В классе N человек. Каждый из них получил за урок по информатике оценку: 3, 4 или 5, двоек сегодня не было.
# Напишите программу, которая получает список оценок - N чисел - и выводит на экран сообщение о том,
# кого сегодня больше: отличников, хорошистов или троечников.

grade_3 = 0
grade_4 = 0
grade_5 = 0
count_class = int(input('Сколько человек в классе: '))
for count in range(1, count_class+1):
    grade = int(input('Какую оценку получил: '))
    if grade == 3:
        grade_3 += 1
    elif grade == 4:
        grade_4 += 1
    else:
        grade_5 += 1
if grade_3 > grade_4 and grade_3 > grade_5:
    print('Сегодня больше троечников!')
elif grade_4 > grade_3 and grade_4 > grade_5:
    print('Сегодня больше хорошистов!')
else:
    print('Сегодня больше отличников!')

    
