# Саша просыпается когда угодно, но в 23 часа уже точно идёт спать.
# Питается Саша следующим образом: каждые 3 часа он выпивает литр воды и съедает N калорий.
# Пить и есть он, кстати, начинает сразу как только проснётся.
# Напишите программу, которая считает сколько он выпьет литров воды и сколько калорий он съест перед тем как пойдёт спать.


water = 0
summ_calor = 0
time = int(input('Во сколько проснулся? '))
for n in range(time, 23, 3):
    print('Время приема пищи: ', n)
    water += 1
    calories = int(input('Сколько съел? '))
    summ_calor += calories
print('Выпито воды: ', water)
print('Сумма каллорий: ', summ_calor)
