# У Саши интересный режим сна: он может проснуться когда угодно, хоть ночью, но засыпает всегда до того,
# как наступит полночь, обычно в 23 часа. А ещё он очень любит поесть.
# Он ест каждый час и если съедает больше 2000 калорий, то он просто падает спать.
# Напишите программу, которая поможет Саше понять, всё ли с ним хорошо.
# Для этого нужно посчитать, сколько он всего съест калорий и сколько часов будет бодрым.


summ_call = 0
morning = int(input('Во сколько вы проснулись? '))
slip = 23
for sasha in range(morning, slip):
    print(sasha, 'час')
    call = int(input('Сколько вы съели? '))
    summ_call += call
    if summ_call > 2000:
        print('Засыпаем...')
        break
print('Всего каллорий ', summ_call)
