# Напишите программу, которая запрашивает у пользователя число N и находит сумму факториалов


summ = 0
y = 1
number = int(input('Введите число: '))
for n in range(1, number+1):
    y *= n
    summ += y
print('Сумма факториалов равна: ', summ)