# Напишите программу, которая находит и выводит все двузначные числа, которые равны утроенному
# произведению своих цифр. К таким относятся, например, 15 и 24.

a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
for ab in range(a, b+1):
     total = ab // 10
     total_2 = ab % 10
     total_3 = total * total_2 * 3
     if ab > 9 and ab < 100 and ab == total_3:
        print(ab)