# Напишите функцию count_letters, которая принимает на вход текст и подсчитывает, какое в нём количество цифр K и букв N.
# Функция должна вывести на экран информацию о найденных буквах и цифрах в определённом формате.


def count_letters():
    t = input('Введите текст: ')
    k = input('Какую цифру ищем? ')
    n = input('Какую букву ищем? ')
    count_k = 0
    count_n = 0
    for i in (t):
        if i == k:
            count_k += 1
        if i == n:
            count_n += 1
    print('Количество цифр', k, ':', count_k)
    print('Количество букв', n, ':', count_n)

count_letters()