# Основная ветка программы, не считая заголовков функций, состоит из одной строки кода. Это вызов функции test().
# В ней запрашивается на ввод целое число. Если оно положительное, то вызывается функция positive(),
# тело которой содержит команду вывода на экран слова «Положительное».
# Если число отрицательное, то вызывается функция negative(), её тело содержит выражение вывода на экран слова «Отрицательное».


def test():
    x = int(input('Введите целове число: '))
    if x > 0:
        positive()
    elif x < 0:
        negative()

def positive():
    print('Положительное.')
    test()

def negative():
    print('Отрицательное.')
    test()

test()
