# Нам поручили усовершенствовать GPS-навигатор, добавив в него новую фишку. Теперь пользователь может не только смотреть расстояние от себя до объекта,
# но и задавать в навигаторе две произвольные точки, после чего на экран ему выводится расстояние между ними.
# Для этого пользователь вводит четыре действительных числа x1, y1, x2, y2 — это как раз координаты этих двух точек.
# Напишите программу, где у пользователя спрашивается, чего он хочет — найти расстояние от себя до точки или найти расстояние
# между двумя произвольными точками, после чего запрашиваются необходимые координаты точек и выводится ответ на экран.


import math

def myDistance(x, y):
    distanse = math.sqrt(x ** 2 + y ** 2)
    print(distanse)

def betweenDistance (x_1, y_1, x_2, y_2):
    distance = math.sqrt((x_2 - x_1) ** 2 + (y_2 - y_1) ** 2)
    print(distance)

choice = int(input('1 - расстояние до точки, 2 - расстояние между точками: '))

if choice == 1:
    x = float(input('Введите икс: '))
    y = float(input('Введите y: '))
    myDistance(x, y)

elif choice == 2:
    x_1 = float(input('Введите икс первый: '))
    x_2 = float(input('Введите икс второй: '))
    y_1 = float(input('Введите y первый: '))
    y_2 = float(input('Введите у второй: '))
    betweenDistance(x_1,x_2,y_1,y_2)
else:
    print('Ошибка ввода.')
