# Напишите игру — текстовый квест. Игрок находится в квартире, его задача — покинуть её.
# Игрок свободно перемещается по квартире, пока не покинет её.
# В квартире есть три комнаты (спальня, кухня, ванна) и коридор. В ванну можно попасть из коридора и спальни.
# В спальню можно попасть из ванны и коридора. На кухню можно попасть только из коридора.
# Коридор связан со всеми комнатами, но в нём дополнительно есть дверь наружу.
# На кухне открыто окно. Если игрок пытается выбраться через него, то разбивается и проигрывает.


def bedroom():
    print('Вы в спальне. Куда идем?')
    print('1 - в ванну')
    print('2 - в коридор')
    q = int(input())
    if q == 1:
        bath()
    elif q == 2:
        corridor()
    else:
        bedroom()

def kitchen():
    print('Вы на кухне. Куда идем?')
    print('1 - в коридор')
    print('2 - в окно')
    q = int(input())
    if q == 1:
        corridor()
    elif q == 2:
        print('Вы разбились! Игра окончена.')
    else:
        kitchen()

def bath():
    print('Вы в ванне. Куда идем?')
    print('1 - в коридор')
    print('2 - в спальню')
    q = int(input())
    if q == 1:
        corridor()
    elif q == 2:
        bedroom()
    else:
        bath()

def corridor():
    print('Вы в коридоре. Куда идем?')
    print('1 - в спальню')
    print('2 - в ванну')
    print('3 - на кухню')
    print('4 - в дверь')
    q = int(input())
    if q == 1:
        bedroom()
    elif q == 2:
        bath()
    elif q == 3:
        kitchen()
    elif q == 4:
        print('Вы нашли выход! Игра окончана!')
    else:
        corridor()


start = int(input('С какой комнаты начнем: 1 - спальня, 2 - кухня, 3 - ванна, 4 - коридор: '))
if start == 1:
    bedroom()
elif start == 2:
    kitchen()
elif start == 3:
    bath()
elif start == 4:
    corridor()
else:
    print('Ошибка ввода!')
