# Вклад в банке составляет X рублей. Ежегодно он увеличивается на P процентов,
# после чего дробная часть копеек отбрасывается. Определите, через сколько лет вклад составит не менее Y рублей.
# Напишите программу, которая по данным числам X, Y, P определяет, сколько лет пройдёт, прежде чем сумма достигнет значения Y.


contributions = int(input('Сколько вы готовы внести: '))
total = int(input('Сколько хотите накопить? '))
percent = int(input('Укажите процент: '))
percent_new = percent / 100
i = 0
while contributions < total:
    contributions += contributions * percent_new
    i += 1
print('Необходимое количество лет: ', i)
print('Сумма составит: ', contributions // 1)
