# Напишите программу, которая получала бы на входе шестизначный номер билета и выводила, счастливый это билет или нет.
# К примеру, билеты 666 666 и 252 135 — счастливые, а 123 456 — нет.
# Подумайте, нужны ли для решения этой задачи циклы?


ticket = int(input('Введите номер билета (6 цифр): '))
ticket_1 = ticket // 1000
ticket_2 = ticket % 1000

summ_1 = (ticket_1 // 100) + (ticket_1 % 10) + ((ticket_1 % 100) // 10)
summ_2 = (ticket_2 // 100) + (ticket_2 % 10) + ((ticket_2 % 100) // 10)
if summ_1 == summ_2:
    print('Это счасливый билет!')
else:
    print('Увы...')