# Теперь мальчик загадывает число между 1 и 100 (включительно).
# Компьютер может спросить у мальчика: «Твоё число равно, меньше или больше, чем число N?»,
# где N — число, которое хочет проверить компьютер. Мальчик отвечает одним из трёх чисел: 1 — равно, 2 — больше, 3 — меньше.
# Напишите программу, которая с помощью цепочки таких вопросов и ответов мальчика угадывает число.
# Дополнительно: сделайте так, чтобы можно было гарантированно угадать число за семь попыток.



n_1 = 1
n_2 = 100
while True:
    n = (n_1 + n_2) // 2
    print('Твоё число равно, меньше или больше, чем чиcло:', n, '?')
    number = int(input('1 - равно, 2 - больше, 3 меньше '))
    if number == 1:
        print('Я угадал, твое число ', n)
        break
    elif number == 2:
        n_1 = n
    else:
        n_2 = n