# Дима написал программу-вирус специально для того, чтобы проучить своего друга-должника,
# который никак не хочет возвращать скейтборд. Программа не даёт работать за компьютером и
# постоянно выводит на экран сообщение «Компьютер заблокирован. Вернёшь скейт — скажу код разблокировки!».
# Как только вводится правильный код, вирус удаляется. Напишите такую же программу, которую написал Дима.


key = '0'
while key != '0550':
    print('Компьютер заблокирован. Вернешь скейт - скажу код разблокировки!')
    key = input('Введите код: ')
    if key == '0550':
        print('Код верный, завершаю работу...')
        break


